In [23]:
import pandas as pd

file_path = "dirty_data.csv"
df = pd.read_csv(file_path)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  11 non-null     int64
 1   name         11 non-null     object
 2   age          10 non-null     float64
 3   gender       11 non-null     object
 4   dob          11 non-null     object
 5   income       10 non-null     object
 6   email        11 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 744.0+ bytes

In [24]:
miss_val = df.isnull().sum()
miss_val

customer_id    0
name           0
age            1
gender         0
dob            0
income         1
email          0
dtype: int64

In [25]:
df['income'] = pd.to_numeric(df['income'], errors='coerce')
df['age'].fillna(df['age'].median(), inplace=True)
df['income'].fillna(df['income'].median(), inplace=True)

df.isnull().sum

/var/folders/8_/fl08gppj6q30h3nrwn1kc9140000gn/T/ipykernel_2913/1664185433.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(), inplace=True)
/var/folders/8_/fl08gppj6q30h3nrwn1kc9140000gn/T/ipykernel_2913/1664185433.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['income'].fillna(df['income'].median(), inplace=True)

<bound method DataFrame.sum of     customer_id   name    age  gender    dob  income  email
0         False  False  False   False  False   False  False
1         False  False  False   False  False   False  False
2         False  False  False   False  False   False  False
3         False  False  False   False  False   False  False
4         False  False  False   False  False   False  False
5         False  False  False   False  False   False  False
6         False  False  False   False  False   False  False
7         False  False  False   False  False   False  False
8         False  False  False   False  False   False  False
9         False  False  False   False  False   False  False
10        False  False  False   False  False   False  False>

In [26]:
df[['firstname', 'lastname']] = df['name'].str.rsplit(n=1, expand=True)

# Xóa cột "Name" nếu không cần thiết
df.drop(columns=['name'], inplace=True)

# Hiển thị kết quả
print(df)

    customer_id    age   gender         dob  income          email  \
0           101   25.0     Male  1998-05-22  1200.0  a@example.com
1           102   42.0   Female  1981-07-14  4500.0  b@example.com
2           103   -5.0     male  12/03/1995  3200.0  c@example.com
3           104  150.0        F  1980/08/25  -500.0  d@example.com
4           105   30.0      Fem  1993-09-30  3800.0  e@example.com
5           106   28.0        M  1996-11-02  2500.0  f@example.com
6           107   29.0   Female  1994/06/15  3800.0  g@example.com
7           108   40.0        f  1990-01-29  4200.0  h@example.com
8           109   27.0     Male  1995-04-10  3900.0  i@example.com
9           110   22.0  unknown  1999-12-20  3800.0  j@example.com
10          110   22.0     Male  1999-12-20  3900.0  j@example.com

     firstname lastname
0   Nguyen Van        A
1     Tran Thi        B
2       Le Van        C
3   Hoang Minh        D
4     Pham Thi        E
5   Nguyen Van        F
6      Bui Thi        G
7     Dang Van        H
8       Vo Thi        I
9     Phan Van        J
10    Phan Van        J

In [27]:
df = df[(df['age'] >= 0) & (df['age'] <= 100)]
df = df[df['income'] >= 0]

df[['age', 'income']].describe()

             age       income
count   9.000000     9.000000
mean   29.444444  3511.111111
std     7.143373  1022.795733
min    22.000000  1200.000000
25%    25.000000  3800.000000
50%    28.000000  3800.000000
75%    30.000000  3900.000000
max    42.000000  4500.000000

In [28]:
df['dob'] = pd.to_datetime(df['dob'], errors='coerce').dt.strftime('%Y-%m-%d')

df['gender'] = df['gender'].str.lower().map({'male': 'Male', 'female': 'Female', 'f': 'Female', 'fem': 'Female'})

df[['dob', 'gender']].head()

          dob  gender
0  1998-05-22    Male
1  1981-07-14  Female
4  1993-09-30  Female
5  1996-11-02     NaN
6         NaN  Female

In [29]:
df.drop_duplicates(inplace=True)

df.shape

(9, 8)

In [30]:
df.dropna(inplace=True)
df

,customer_id,age,gender,dob,income,email,firstname,lastname
0,101,25.0,Male,1998-05-22,1200.0,a@example.com,Nguyen Van,A
1,102,42.0,Female,1981-07-14,4500.0,b@example.com,Tran Thi,B
4,105,30.0,Female,1993-09-30,3800.0,e@example.com,Pham Thi,E
7,108,40.0,Female,1990-01-29,4200.0,h@example.com,Dang Van,H
8,109,27.0,Male,1995-04-10,3900.0,i@example.com,Vo Thi,I
10,110,22.0,Male,1999-12-20,3900.0,j@example.com,Phan Van,J